Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterBase Class
 The AnalysisDesignParameterBase class contains base information related to analysis design parameters.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDesignParameterBase
 Tekla.Structures.Analysis.AnalysisDesignParameter
 Tekla.Structures.Analysis.AnalysisDesignParameterMulti
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract class AnalysisDesignParameterBase : AnalysisObject
Public MustInherit Class AnalysisDesignParameterBase
	Inherits AnalysisObject
The AnalysisDesignParameterBase type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
IsGeneral
 Gets or sets a value indicating whether the design parameter is general.
Name
 Gets or sets the name of the analysis design parameter.
Unit
 Gets or sets the unit of the analysis design parameter.
Top
Methods
Name | Description
Modify
 Modifies an analysis design parameter at the database. Inserts if parameter does not exist.
Select
 Selects an analysis object from the database.
 (Inherited from AnalysisObject.)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace